# frozen_string_literal: true
cask_args appdir: '/Applications'
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "gcc"
brew "git"
brew 'mas'
brew 'git-flow'
brew 'mysql'
brew "python@3.9", link: false
brew 'nvm'
brew 'tree'
brew 'cmake'
brew 'gh'
brew 'python-launcher'
brew 'node'


mas 'iMovie', id: 408981434
mas 'Startup Disk Full Fixer (1.4)', id: 1346655838
mas 'DaisyDisk (4.21.4)', id: 411643860
mas 'Battery Monitor: Health, Info', id: 836505650
mas 'Microsoft Outlook', id: 985367838
mas 'Microsoft Word', id: 462054704
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft PowerPoint', id: 462062816
mas 'Microsoft OneNote', id: 784801555
mas 'OneDrive', id: 823766827
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'Speedtest by Ookla', id: 1153157709
mas 'The Unarchiver', id: 425424353
mas 'FileZilla Pro - FTP and Cloud', id: 1298486723
mas 'HotspotShield VPN - Wifi Proxy', id: 771076721


# Homebrew GUI App for OS X
cask 'cakebrew'
 # macOS system monitor in your menu bar
cask 'stats'
# A password manager, digital vault, form filler and secure digital wallet
cask '1password'
cask "alfred"
cask "db-browser-for-sqlite"
cask "evernote"
cask "gimp"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "mysqlworkbench"
cask "postman"
cask "powershell"
#cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask 'sequel-pro'
cask 'sketch'
cask 'sourcetree'
cask 'google-chrome'
# Terminal Emulator for macOS
cask 'iterm2'
cask 'beyond-compare'
cask 'macs-fan-control'
cask 'zoom'
cask 'microsoft-teams'
cask 'adobe-acrobat-reader'
cask 'tuxera-ntfs'
cask 'dotnet'
cask 'dotnet-sdk'


